---
kind: type
id: T:Autodesk.Revit.DB.KeyBasedTreeEntriesIterator
source: html/d842419d-d2a9-a839-0944-82f163884362.htm
---
# Autodesk.Revit.DB.KeyBasedTreeEntriesIterator

An iterator to a set of KeyBasedTreeEntry objects.

## Syntax (C#)
```csharp
public class KeyBasedTreeEntriesIterator : IEnumerator<KeyBasedTreeEntry>
```